app/Controllers/Quest.php

SELECT *
FROM `quest`
WHERE `qnum` = 2
AND `category` = 'quest'
 LIMIT 1
---
    public function getriddle()
    {
        $session = $this->startSession();
        $return = $this->QuestModel->select('qnum, riddle')->where(['qnum' => $session->get('qnum'), 'category' => $session->get('category')])->first();
        if(!$return)
        {
            $this->questsessionxdb();
            return $this->response->setJSON(['status' => 0, 'msg' => 'Your have reached the end of the quest, congratulations! ...', 'final score' => $session->get('score')]);

SELECT *
FROM `quest`
WHERE `qnum` = 1
AND `category` = 'quest'
 LIMIT 1
---
    public function solveriddle($solution = false)
    {
        if (!$solution)
        return $this->response->setJSON(['status' => 1, 'msg' => 'missing parameter: solution']);
        $session = $this->startSession();
        $riddle = $this->QuestModel->where(['qnum' => $session->get('qnum'), 'category' => $session->get('category')])->first();